# HR_salary prediction

### Importing necessary libraries

In [1]:
import pandas as pd
from sklearn import linear_model
from word2number import w2n

### Reading Excel File and making dataset

In [2]:
df=pd.read_excel("Multi_linear_reg_HR_salary.xlsx")
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

### Handling Null values

In [3]:
df.fillna({
    'experience':'one',
    'test_score':df['test_score'].median()
},inplace=True)

df

  experience  test_score  interview_score  salary
0        one         8.0                9   50000
1        one         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [4]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score  interview_score  salary
0           1         8.0                9   50000
1           1         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

### Building Model

In [5]:
reg=linear_model.LinearRegression()
reg.fit(df[['experience','test_score','interview_score']],df.salary)

LinearRegression()

### coefficient and intercept of regression line

In [6]:
print(reg.coef_,reg.intercept_)

[3031.1979513  1893.22650937 2485.73083785] 13359.721134159743

In [7]:
reg.predict([[2,8,9],[5,5,5]])

D:\Program Files\Anaconda\New folder\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([56939.50665236, 50410.49762674])

### Storing model in pickle file

In [8]:
import pickle
with open('HR_model.pkl','wb') as f:
    pickle.dump(reg,f)
with open('HR_model.pkl','rb') as f:
    model=pickle.load(f)
model.predict([[2,8,9]])

D:\Program Files\Anaconda\New folder\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([56939.50665236])